ciaa/firmware_v1/externals/drivers/msp430/inc/msp430fr5987.h
/* ESIOSC Control Bits */
#define ESICLKFQ5           (0x2000)      /* Internal oscillator frequency adjust */
#define ESICLKFQ4           (0x1000)      /* Internal oscillator frequency adjust */
#define ESICLKFQ3           (0x0800)      /* Internal oscillator frequency adjust */
#define ESICLKFQ2           (0x0400)      /* Internal oscillator frequency adjust */
#define ESICLKFQ1           (0x0200)      /* Internal oscillator frequency adjust */
#define ESICLKFQ0           (0x0100)      /* Internal oscillator frequency adjust */
#define ESICLKGON           (0x0002)      /* Internal oscillator control */
#define ESIHFSEL            (0x0001)      /* Internal oscillator enable */

/* ESIOSC Control Bits */
#define ESICLKGON_L         (0x0002)      /* Internal oscillator control */
#define ESIHFSEL_L          (0x0001)      /* Internal oscillator enable */

/* ESIOSC Control Bits */
#define ESICLKFQ5_H         (0x0020)      /* Internal oscillator frequency adjust */
#define ESICLKFQ4_H         (0x0010)      /* Internal oscillator frequency adjust */
#define ESICLKFQ3_H         (0x0008)      /* Internal oscillator frequency adjust */
#define ESICLKFQ2_H         (0x0004)      /* Internal oscillator frequency adjust */
#define ESICLKFQ1_H         (0x0002)      /* Internal oscillator frequency adjust */
#define ESICLKFQ0_H         (0x0001)      /* Internal oscillator frequency adjust */

/* ESICTL Control Bits */
#define ESIS3SEL2           (0x8000)      /* PPUS3 source select */
#define ESIS3SEL1           (0x4000)      /* PPUS3 source select */
#define ESIS3SEL0           (0x2000)      /* PPUS3 source select */
#define ESIS2SEL2           (0x1000)      /* PPUS2 source select */
#define ESIS2SEL1           (0x0800)      /* PPUS2 source select */
#define ESIS2SEL0           (0x0400)      /* PPUS2 source select */
#define ESIS1SEL2           (0x0200)      /* PPUS1 source select */
#define ESIS1SEL1           (0x0100)      /* PPUS1 source select */
#define ESIS1SEL0           (0x0080)      /* PPUS1 source select */
#define ESITCH11            (0x0040)      /* select the comparator input for test channel 1 */
#define ESITCH10            (0x0020)      /* select the comparator input for test channel 1 */
#define ESITCH01            (0x0010)      /* select the comparator input for test channel 0 */
#define ESITCH00            (0x0008)      /* select the comparator input for test channel 0 */
#define ESICS               (0x0004)      /* Comparator output/Timer_A input selection */
#define ESITESTD            (0x0002)      /* Test cycle insertion */
#define ESIEN               (0x0001)      /* Extended Scan interface enable */

/* ESICTL Control Bits */
#define ESIS1SEL0_L         (0x0080)      /* PPUS1 source select */
#define ESITCH11_L          (0x0040)      /* select the comparator input for test channel 1 */
#define ESITCH10_L          (0x0020)      /* select the comparator input for test channel 1 */
#define ESITCH01_L          (0x0010)      /* select the comparator input for test channel 0 */
#define ESITCH00_L          (0x0008)      /* select the comparator input for test channel 0 */
#define ESICS_L             (0x0004)      /* Comparator output/Timer_A input selection */
#define ESITESTD_L          (0x0002)      /* Test cycle insertion */
#define ESIEN_L             (0x0001)      /* Extended Scan interface enable */

/* ESICTL Control Bits */
#define ESIS3SEL2_H         (0x0080)      /* PPUS3 source select */
#define ESIS3SEL1_H         (0x0040)      /* PPUS3 source select */
#define ESIS3SEL0_H         (0x0020)      /* PPUS3 source select */
#define ESIS2SEL2_H         (0x0010)      /* PPUS2 source select */
#define ESIS2SEL1_H         (0x0008)      /* PPUS2 source select */
#define ESIS2SEL0_H         (0x0004)      /* PPUS2 source select */
#define ESIS1SEL2_H         (0x0002)      /* PPUS1 source select */
#define ESIS1SEL1_H         (0x0001)      /* PPUS1 source select */

#define ESIS3SEL_0          (0x0000)      /* ESIOUT0 is the PPUS3 source */
#define ESIS3SEL_1          (0x2000)      /* ESIOUT1 is the PPUS3 source */
#define ESIS3SEL_2          (0x4000)      /* ESIOUT2 is the PPUS3 source */
#define ESIS3SEL_3          (0x6000)      /* ESIOUT3 is the PPUS3 source */
#define ESIS3SEL_4          (0x8000)      /* ESIOUT4 is the PPUS3 source */
#define ESIS3SEL_5          (0xA000)      /* ESIOUT5 is the PPUS3 source */
#define ESIS3SEL_6          (0xC000)      /* ESIOUT6 is the PPUS3 source */
#define ESIS3SEL_7          (0xE000)      /* ESIOUT7 is the PPUS3 source */
#define ESIS2SEL_0          (0x0000)      /* ESIOUT0 is the PPUS2 source */
#define ESIS2SEL_1          (0x0400)      /* ESIOUT1 is the PPUS2 source */
#define ESIS2SEL_2          (0x0800)      /* ESIOUT2 is the PPUS2 source */
#define ESIS2SEL_3          (0x0C00)      /* ESIOUT3 is the PPUS2 source */
#define ESIS2SEL_4          (0x1000)      /* ESIOUT4 is the PPUS2 source */
#define ESIS2SEL_5          (0x1400)      /* ESIOUT5 is the PPUS2 source */
#define ESIS2SEL_6          (0x1800)      /* ESIOUT6 is the PPUS2 source */
#define ESIS2SEL_7          (0x1C00)      /* ESIOUT7 is the PPUS2 source */
#define ESIS1SEL_0          (0x0000)      /* ESIOUT0 is the PPUS1 source */
#define ESIS1SEL_1          (0x0080)      /* ESIOUT1 is the PPUS1 source */
#define ESIS1SEL_2          (0x0100)      /* ESIOUT2 is the PPUS1 source */
#define ESIS1SEL_3          (0x0180)      /* ESIOUT3 is the PPUS1 source */
#define ESIS1SEL_4          (0x0200)      /* ESIOUT4 is the PPUS1 source */
#define ESIS1SEL_5          (0x0280)      /* ESIOUT5 is the PPUS1 source */
#define ESIS1SEL_6          (0x0300)      /* ESIOUT6 is the PPUS1 source */
#define ESIS1SEL_7          (0x0380)      /* ESIOUT7 is the PPUS1 source */
#define ESITCH1_0           (0x0000)      /* Comparator input is ESICH0 when ESICAX = 0; Comparator input is ESICI0 when ESICAX = 1 */
#define ESITCH1_1           (0x0400)      /* Comparator input is ESICH1 when ESICAX = 0; Comparator input is ESICI1 when ESICAX = 1 */
#define ESITCH1_2           (0x0800)      /* Comparator input is ESICH2 when ESICAX = 0; Comparator input is ESICI2 when ESICAX = 1 */
#define ESITCH1_3           (0x0C00)      /* Comparator input is ESICH3 when ESICAX = 0; Comparator input is ESICI3 when ESICAX = 1 */
#define ESITCH0_0           (0x0000)      /* Comparator input is ESICH0 when ESICAX = 0; Comparator input is ESICI0 when ESICAX = 1 */
#define ESITCH0_1           (0x0008)      /* Comparator input is ESICH1 when ESICAX = 0; Comparator input is ESICI1 when ESICAX = 1 */
#define ESITCH0_2           (0x0010)      /* Comparator input is ESICH2 when ESICAX = 0; Comparator input is ESICI2 when ESICAX = 1 */
#define ESITCH0_3           (0x0018)      /* Comparator input is ESICH3 when ESICAX = 0; Comparator input is ESICI3 when ESICAX = 1 */

/* Timing State Machine Control Bits */
#define ESIREPEAT4          (0x8000)      /* These bits together with the ESICLK bit configure the duration of this state */
#define ESIREPEAT3          (0x4000)      /* ESIREPEATx selects the number of clock cycles for this state. The number of clock cycles = ESIREPEATx + 1 */
#define ESIREPEAT2          (0x2000)      /* */
#define ESIREPEAT1          (0x1000)      /* */
#define ESIREPEAT0          (0x0800)      /* */
#define ESICLK              (0x0400)      /* This bit selects the clock source for the TSM */
#define ESISTOP             (0x0200)      /* This bit indicates the end of the TSM sequence */
#define ESIDAC              (0x0100)      /* TSM DAC on */
#define ESITESTS1           (0x0080)      /* TSM test cycle control */
#define ESIRSON             (0x0040)      /* Internal output latches enabled */
#define ESICLKON            (0x0020)      /* High-frequency clock on */
#define ESICA               (0x0010)      /* TSM comparator on */
#define ESIEX               (0x0008)      /* Excitation and sample-and-hold */
#define ESILCEN             (0x0004)      /* LC enable */
#define ESICH1              (0x0002)      /* Input channel select */
#define ESICH0              (0x0001)      /* Input channel select */

/* Timing State Machine Control Bits */
#define ESITESTS1_L         (0x0080)      /* TSM test cycle control */
#define ESIRSON_L           (0x0040)      /* Internal output latches enabled */
#define ESICLKON_L          (0x0020)      /* High-frequency clock on */
#define ESICA_L             (0x0010)      /* TSM comparator on */
#define ESIEX_L             (0x0008)      /* Excitation and sample-and-hold */
#define ESILCEN_L           (0x0004)      /* LC enable */
#define ESICH1_L            (0x0002)      /* Input channel select */
#define ESICH0_L            (0x0001)      /* Input channel select */

/* Timing State Machine Control Bits */
#define ESIREPEAT4_H        (0x0080)      /* These bits together with the ESICLK bit configure the duration of this state */
#define ESIREPEAT3_H        (0x0040)      /* ESIREPEATx selects the number of clock cycles for this state. The number of clock cycles = ESIREPEATx + 1 */
#define ESIREPEAT2_H        (0x0020)      /* */
#define ESIREPEAT1_H        (0x0010)      /* */
#define ESIREPEAT0_H        (0x0008)      /* */
#define ESICLK_H            (0x0004)      /* This bit selects the clock source for the TSM */
#define ESISTOP_H           (0x0002)      /* This bit indicates the end of the TSM sequence */
#define ESIDAC_H            (0x0001)      /* TSM DAC on */

